{
  "name": "洪雋倫",
  "company": "偉斯股份有限公司",
  "contactDetails": "聯絡方式",
  "skill": "技術",
  "gitStats": "Github 數據分佈",
  "imporve": "目前精進技術",
  "education": "曾經進修",
  "hobbies": "興趣",
  "about": "關於我",
  "personal": "個人特質",
  "personalContent": "責任感、專注、變通",
  "aboutContent1": "本人畢業於中央大學應用地質研究所，畢業後在環境公司擔任專案經理一職，在任職期間因業務關係，需協助處理產品（桌面應用程式，使用electron.js開發）之介面處理，因而接觸到前端領域，並逐漸產生興趣，開始利用閒暇時間自學，並於評估後，決定順從自身興趣，轉換工作跑道，報名了資策會的前端進修班。",
  "aboutContent2": "於資策會結訓後月餘，本人加入偉斯股份有限公司擔任前端工程師一職，在任職初期，主要業務為開發公司產品掃瞄器之配套軟體，該軟體主要功能為與可與掃瞄器溝通並進行韌體升級，或是可調整掃描器之功能並產生設定檔案，透過掃條碼或是連結升級的方式對掃瞄器進行升級。除配套軟體外，亦幫忙工廠調整製作協助生產流程的軟體，讓工廠可更有效率的生產產品。現階段則在為公司規劃並編寫後台、後端與資料庫。",
  "aboutContent3": "在我的閒暇之餘，我喜歡打羽球、騎單車以及和去卡店打卡牌遊戲。另外也有規劃每週固定時間精進程式技術，目前正在研究React與Typescript，並嘗試撰寫一些小專案。除精進不熟悉的技術領域外，也與朋友合作，建立一卡牌資訊網頁，此網頁包含完整之網頁結構(前台、後台、後端及資料庫)，並預計初步完成後將之部署於AWS上，並開放給卡牌玩家使用。",
  "project": "個人作品",
  "target": "專案目標:",
  "technology": "使用技術:",
  "progress": "目前現況",
  "source": "連結:",
  "pt1": "卡壇",
  "pl11": "用戶端",
  "pl12": "內容管理系統",
  "pl13": "API文件",
  "pl14": "爬蟲",
  "pl15": "後端",
  "pta1": "此專案目的在於提供卡牌愛好者，瀏覽其他用戶撰寫之文章、卡片查詢、抑或是組配牌組使用，並且透過爬蟲所得的價格資料，可以讓整個卡片價格更加透明化，用戶亦可申請帳號成為此網頁之部落客，於後台上進行文章撰寫並讓其他用戶觀看。",
  "po1": "目前CMS及後端已經大致完成，爬蟲已部屬於AWS EC2上，於每日固定時間進行價格資料爬蟲，僅剩用戶端正在開發中，預計2023/12月左右可以完成，屆時預計將搭配Nginx一併部屬於AWS上",
  "pt2": "看房筆記本",
  "pl21": "GitHub",
  "pl22": "網頁(Vercel)",
  "pta2": "此專案之目標主打想要購屋的用戶，主要用於看房時，可隨手紀錄筆記並及時上傳圖片分享給其他用戶觀看，並可於地圖中點選標的物件，瀏覽其他用戶之評論以作為是否下手的依據之一",
  "po2": "目前此專案已完成包含登入之所有基本功能，並架設於Vercel上",
  "pt3": "個人形象網站",
  "pta3": "此網頁為本人的形象網站，內容包含個人作品，我的專長、興趣、基本資訊，及聯絡我的方式，並使用three.js及cannon，建構3D畫面及物理碰撞等背景特效",
  "po3": "目前此專案已經完成，並架設於Vercel上",
  "edu": "學歷",
  "workExperiences": "工作經驗",
  "workDetail": "公司主要產品為各類型的掃描器，本人主要在此公司中負責開發搭配掃描器的各種桌面應用程式，以及協助驗證部門、工廠作業之中小型工具，並將公司之韌體、硬體參數，各類應用文件等資訊整合到資料庫，並建立公司之CMS以利各部門進行資料管理，近期亦協助主管帶領新進實習生了解其所需接觸之專案",
  "productInfo": "專案簡述",
  "pr1": "此專案為一桌面應用程式，其作為搭配掃描器使用，可對掃描器進行更新、調整參數、設定格式...等功能，並可產出參數修正檔案(PDF、WORD、PNG)",
  "pr2": "此專案為桌面應用程式，可透過comport通訊方式，跟藍芽掃描器的軟體狗通訊，取得藍芽的Mac address，並產生條碼讓藍芽掃瞄器可以快速跟軟體狗配對",
  "pr3": "此專案主要是用來管理公司所有重要參數、文件等資料庫的內容管理系統，為一個從零開始的專案，從用戶流程規劃、ER模型、線框圖、資料庫選擇，到CMS介面、後端開發，以及將此專案透過Nginx架設至公司伺服器上，目前此專案已完成第一階段並正在使用中"
}
